In [1]:
import numpy as np
import pandas as pd

In [2]:
mainfile=pd.read_csv("Total Male and female voters per districts.csv")

In [3]:
mainfile

        District     Male   Female  Third Gender    Totall
0         Achham    60441    67299             2    127742
1   Arghakhanchi    60296    66403             0    126699
2        Baglung    73963    82839             0    156802
3        Baitadi    60227    64596             1    124824
4        Bajhang    47888    49721             1     97610
..           ...      ...      ...           ...       ...
75        Tanahu    90144  3104327             0    194471
76     Taplejung    37187    33591             0     70778
77     Terhathum    30334    30370             0     60704
78      Udayapur    88510    86951             0    175461
79         Total  7069714  6984625           143  14054482

[80 rows x 5 columns]

In [4]:
mainfile.loc[mainfile['Male'] == 0]

   District  Male  Female  Third Gender  Totall
24    Gulmi     0   94759             1  180775

In [5]:
import numpy as np

In [6]:
mainfile['Totall'].astype(np.int64)

ValueError: invalid literal for int() with base 10: '????'

In [7]:
mainfile.loc[mainfile['Totall'] == '????']

    District   Male  Female  Third Gender Totall
27  Jajarkot  42410   36536             1   ????
28  Jajarkot  42410   36536             1   ????
29  Jajarkot  42410   36536             1   ????

In [8]:
mainfile.loc[mainfile['Totall'] == '????']

    District   Male  Female  Third Gender Totall
27  Jajarkot  42410   36536             1   ????
28  Jajarkot  42410   36536             1   ????
29  Jajarkot  42410   36536             1   ????

In [9]:
mainfile.drop([28, 29])

        District     Male   Female  Third Gender    Totall
0         Achham    60441    67299             2    127742
1   Arghakhanchi    60296    66403             0    126699
2        Baglung    73963    82839             0    156802
3        Baitadi    60227    64596             1    124824
4        Bajhang    47888    49721             1     97610
..           ...      ...      ...           ...       ...
75        Tanahu    90144  3104327             0    194471
76     Taplejung    37187    33591             0     70778
77     Terhathum    30334    30370             0     60704
78      Udayapur    88510    86951             0    175461
79         Total  7069714  6984625           143  14054482

[78 rows x 5 columns]

In [10]:
mainfile.drop([28,29], axis=0, inplace=True)

In [11]:
mainfile.loc[mainfile['Totall'] == '????']

    District   Male  Female  Third Gender Totall
27  Jajarkot  42410   36536             1   ????

In [12]:
maleja=mainfile.iat[27,1]
femaleja=mainfile.iat[27,2]
thirdja=mainfile.iat[27,3]
totalja=maleja+femaleja+thirdja

mainfile['Totall'] = mainfile['Totall'].replace(['????'], totalja)

In [13]:
mainfile.loc[mainfile['Totall'] == '????']

Empty DataFrame
Columns: [District, Male, Female, Third Gender, Totall]
Index: []

In [14]:
mainfile2=mainfile["Totall"].astype(np.int64)

In [15]:
mainfile2

0       127742
1       126699
2       156802
3       124824
4        97610
        ...
75      194471
76       70778
77       60704
78      175461
79    14054482
Name: Totall, Length: 78, dtype: int64

In [17]:
mainfile['Totall']=pd.to_numeric(mainfile['Totall'])

In [51]:
mainfile.dtypes

District        object
Male             int64
Female           int64
Third Gender     int64
Totall           int64
dtype: object

In [20]:
mainfile[mainfile.duplicated(['District'], keep=False)]

              District    Male   Female  Third Gender   Totall
15              Tanahu   90144  3104327             0   194471
49  Nawalparasi (East)  682596    68584             1   131181
50  Nawalparasi (East)   80316    89570             4  2212111
75              Tanahu   90144  3104327             0   194471

In [21]:
mainfile.drop([15], axis=0, inplace=True)

In [22]:
mainfile[mainfile.duplicated(['District'], keep=False)]

              District    Male  Female  Third Gender   Totall
49  Nawalparasi (East)  682596   68584             1   131181
50  Nawalparasi (East)   80316   89570             4  2212111

In [23]:
mainfile.iat[i,1]+mainfile.iat[i,2]+mainfile.iat[i,3] != mainfile.iat[i,4]

NameError: name 'i' is not defined

In [63]:
mainfile.loc[mainfile['Male']+mainfile['Female']+mainfile['Third Gender']!=mainfile['Totall']]

              District    Male   Female  Third Gender   Totall
24               Gulmi   12696    94759             1   180775
33             Kalikot   31668   293360             0    61028
49  Nawalparasi (East)  682596    68584             1   131181
50  Nawalparasi (East)   80316    89570             4  2212111
55              Parbat   47354    51889             0       99
75              Tanahu   90144  3104327             0   194471

In [57]:
totalgulmi=mainfile.loc[24],[4]
femalegulmi=mainfile.loc[24],[2]
thirdgulmi=mainfile.loc[24],[3]

In [39]:
print(mainfile.loc[24][2])

94759

In [62]:
# malegulmi = tuple(map(lambda i, j: i - j, totalgulmi,femalegulmi,))

mainfile['Female'].loc[47] = mainfile['Totall'].loc[47] - mainfile['Male'].loc[47]-mainfile['Third Gender'].loc[47]

C:\Users\Sandesh\AppData\Local\Temp\ipykernel_15752\579793711.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mainfile['Female'].loc[47] = mainfile['Totall'].loc[47] - mainfile['Male'].loc[47]-mainfile['Third Gender'].loc[47]

In [70]:
mainfile.loc[mainfile['Male']+mainfile['Female']+mainfile['Third Gender']!=mainfile['Totall']]

              District    Male   Female  Third Gender   Totall
49  Nawalparasi (East)  682596    68584             1   131181
50  Nawalparasi (East)   80316    89570             4  2212111
55              Parbat   47354    51889             0       99
75              Tanahu   90144  3104327             0   194471

In [67]:
mainfile['Male'].loc[24] = mainfile['Totall'].loc[24] - mainfile['Female'].loc[24]-mainfile['Third Gender'].loc[24]

C:\Users\Sandesh\AppData\Local\Temp\ipykernel_15752\2842057209.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mainfile['Male'].loc[24] = mainfile['Totall'].loc[24] - mainfile['Female'].loc[24]-mainfile['Third Gender'].loc[24]

In [69]:
mainfile['Totall'].loc[33] = mainfile['Male'].loc[33] + mainfile['Female'].loc[33] + mainfile['Third Gender'].loc[33]

C:\Users\Sandesh\AppData\Local\Temp\ipykernel_15752\3197542258.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mainfile['Totall'].loc[33] = mainfile['Male'].loc[33] + mainfile['Female'].loc[33] + mainfile['Third Gender'].loc[33]

In [71]:
mainfile.loc[mainfile['Male']+mainfile['Female']+mainfile['Third Gender']!=mainfile['Totall']]

              District    Male   Female  Third Gender   Totall
49  Nawalparasi (East)  682596    68584             1   131181
50  Nawalparasi (East)   80316    89570             4  2212111
55              Parbat   47354    51889             0       99
75              Tanahu   90144  3104327             0   194471

In [72]:
mainfile['Totall'].loc[55] = mainfile['Male'].loc[55] + mainfile['Female'].loc[55] + mainfile['Third Gender'].loc[55]

C:\Users\Sandesh\AppData\Local\Temp\ipykernel_15752\1959419467.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mainfile['Totall'].loc[55] = mainfile['Male'].loc[55] + mainfile['Female'].loc[55] + mainfile['Third Gender'].loc[55]

In [73]:
mainfile['Totall'].loc[75] = mainfile['Male'].loc[75] + mainfile['Female'].loc[75] + mainfile['Third Gender'].loc[75]

C:\Users\Sandesh\AppData\Local\Temp\ipykernel_15752\2724794669.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mainfile['Totall'].loc[75] = mainfile['Male'].loc[75] + mainfile['Female'].loc[75] + mainfile['Third Gender'].loc[75]

In [74]:
mainfile.loc[mainfile['Male']+mainfile['Female']+mainfile['Third Gender']!=mainfile['Totall']]

              District    Male  Female  Third Gender   Totall
49  Nawalparasi (East)  682596   68584             1   131181
50  Nawalparasi (East)   80316   89570             4  2212111

In [75]:
mainfile['Totall'].loc[49] = mainfile['Male'].loc[49] + mainfile['Female'].loc[49] + mainfile['Third Gender'].loc[49]

C:\Users\Sandesh\AppData\Local\Temp\ipykernel_15752\1345693481.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mainfile['Totall'].loc[49] = mainfile['Male'].loc[49] + mainfile['Female'].loc[49] + mainfile['Third Gender'].loc[49]

In [76]:
mainfile['Totall'].loc[50] = mainfile['Male'].loc[50] + mainfile['Female'].loc[50] + mainfile['Third Gender'].loc[50]

C:\Users\Sandesh\AppData\Local\Temp\ipykernel_15752\334392471.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mainfile['Totall'].loc[50] = mainfile['Male'].loc[50] + mainfile['Female'].loc[50] + mainfile['Third Gender'].loc[50]

In [77]:
mainfile.loc[mainfile['Male']+mainfile['Female']+mainfile['Third Gender']!=mainfile['Totall']]

Empty DataFrame
Columns: [District, Male, Female, Third Gender, Totall]
Index: []

In [78]:
mainfile.loc[50]=['Nawalparasi (West)',80316,89570,4,169890]

In [79]:
mainfile.loc[mainfile['Male']+mainfile['Female']+mainfile['Third Gender']!=mainfile['Totall']]

Empty DataFrame
Columns: [District, Male, Female, Third Gender, Totall]
Index: []

In [81]:
 mainfile

        District     Male   Female  Third Gender    Totall
0         Achham    60441    67299             2    127742
1   Arghakhanchi    60296    66403             0    126699
2        Baglung    73963    82839             0    156802
3        Baitadi    60227    64596             1    124824
4        Bajhang    47888    49721             1     97610
..           ...      ...      ...           ...       ...
75        Tanahu    90144  3104327             0   3194471
76     Taplejung    37187    33591             0     70778
77     Terhathum    30334    30370             0     60704
78      Udayapur    88510    86951             0    175461
79         Total  7069714  6984625           143  14054482

[77 rows x 5 columns]